---
kind: property
id: P:Autodesk.Revit.UI.UIApplication.MainWindowExtents
source: html/1e99edf8-234b-b636-ce88-dde92a75e8a8.htm
---
# Autodesk.Revit.UI.UIApplication.MainWindowExtents Property

Get the rectangle that represents the screen pixel coordinates of the Revit main window.

## Syntax (C#)
```csharp
public virtual Rectangle MainWindowExtents { get; }
```